app/Domains/User/UserRepository.php

    public static function getAuthor($blog)
    {
        $language = LanguageRepository::getPrimaryLanguage($blog);

        $users = User::where('blog_id', '=', $blog->id)
        ->join('users_variants', function($join) use ($language) {
            $join->on('users_variants.user_id', '=', 'users.id');
            $join->where('users_variants.language_id', '=',  $language->id);
        })
        // ->latest()
        ->select('users.*')
        ->get();
---
select * from `user_variants` where `user_variants`.`user_id` in (1)
select `users`.* from `users` inner join `user_variants` on `user_variants`.`user_id` = `users`.`id` and `user_variants`.`language_id` = 1 where `blog_id` = 1

    public static function getBlogsOfUser(int $hyvorUserId): Collection
    {
        return User::where('hyvor_user_id', $hyvorUserId)
            ->where('status', 'active')
            ->orderBy('sort', 'ASC')
            ->orderBy('created_at', 'ASC')
            ->with('blog', 'blog.subscriptions')
            ->get();
---
select * from `blogs` where `blogs`.`id` in (1, 2, 3) and `blogs`.`deleted_at` is null
select * from `users` where `hyvor_user_id` = 1 and `status` = 'active' order by `sort` asc, `created_at` asc

    public static function getUserByBlogIdAndHyvorUserId(int $blogId, int $hyvorUserId) : ?User
    {
        return User::where('blog_id', $blogId)
            ->where('hyvor_user_id', $hyvorUserId)
            ->first();
---
select * from `users` where `blog_id` = 1 and `hyvor_user_id` = 1 limit 1