app/Domains/Language/LanguageRepository.php

select * from `blogs` where `blogs`.`id` = 1 and `blogs`.`deleted_at` is null limit 1
select * from `languages` where `languages`.`blog_id` = 1 and `languages`.`blog_id` is not null order by `is_primary` desc, `id` asc
---
    public static function getAllLanguages(int $blogId) {
        return Blog::find($blogId)->languages()->orderBy('is_primary', 'DESC')->orderBy('id', 'ASC')->get();

select * from `languages` where `languages`.`blog_id` = 1 and `languages`.`blog_id` is not null and `is_primary` = 1 limit 1
---
    public static function getPrimaryLanguage(Blog $blog) : Language {

        return $blog->languages()->where('is_primary', true)->first();