app/Data/Objects/ConsoleAPI/UserBlog/UserBlogBlogObject.php

select * from `languages` where `languages`.`blog_id` = 1 and `languages`.`blog_id` is not null and `is_primary` = 1 limit 1
---
    public function __construct(Blog $blog)
    {
        $plan = null;

        $this->id = $blog->id;
        $this->name = $blog->variants[0]->name;
        $this->subdomain = $blog->subdomain;
        $this->type = $blog->type;
        $this->base_url = PermalinkRepository::getFullUrlFromPath($blog);
        $this->logo_url = 'https://picsum.photos/100/100' ?? $blog->logo_url;
        $this->plan = $plan;

        $counts = CountRepository::getCounts($blog, [
            CountEnum::BLOG_USERS,
            CountEnum::BLOG_POSTS
        ]);
        $this->posts_count = $counts[ CountEnum::BLOG_POSTS->value ];
        $this->users_count = $counts[ CountEnum::BLOG_USERS->value ];

        $this->is_on_trial = $blog->onTrial();
        $this->trial_ends_at = $blog->customer->trial_ends_at?->timestamp;
        $this->subscribed = $blog->subscribed();

        $subscription = $blog->subscription();

        if ($subscription) {
            $this->subscription = new SubscriptionObject($subscription);
        }

        $this->default_language = new LanguageObject(
            $blog->languages()
                ->where('is_primary', true)
                ->first()
        );