app/Domains/Redirect/RedirectRepository.php

    public static function getRedirects( int $blogId, ?int $limit, int $offset = 0) : Collection
    {
        $limit = $limit ?? 50;
        return Redirect::where('blog_id','=', $blogId)
            ->limit($limit)
            ->offset($offset)
            ->latest()
            ->get();
---
select * from `redirects` where `blog_id` = 1 order by `created_at` desc limit 50 offset 0

    public static function createRedirect(
        int $blogId, string $path, string $to, $type
    ) : Redirect
    {
        return Redirect::create([
            'blog_id' => $blogId,
            'path' => $path,
            'to' => $to,
            'type' => $type,
        ]);
---
insert into `redirects` (`blog_id`, `path`, `to`, `type`, `updated_at`, `created_at`) values (1, 'tora', 'lora', '301', '2022-04-25 07:45:13', '2022-04-25 07:45:13')

    public static function updateRedirect(int $blogId ,int $id, string $path, string $to, $type) : void
    {
        $redirect = Redirect::find($id);
---
select * from `redirects` where `redirects`.`id` = 1 limit 1

    public static function deleteRedirect(int $id) : void
    {
        $data = Redirect::find($id);
        $data->delete();
---
select * from `redirects` where `redirects`.`id` = 3 limit 1
delete from `redirects` where `id` = 3