app/Domains/Tag/TagRepository.php

    public static function searchTags(Blog $blog, string $search, int $limit) : Collection
    {

        $search = str_replace('%', '', $search); // to make it safe
        $search .= '%';

        $primaryLanguage = LanguageRepository::getPrimaryLanguage($blog);

        return Tag::join(
            'tag_variants',
            fn ($join) => $join->on('tag_variants.tag_id', '=', 'tags.id')
                ->where('tag_variants.language_id', '=', $primaryLanguage->id)
        )
            ->where('tags.blog_id', $blog->id)
            ->where('tag_variants.name', 'LIKE', $search)
            ->limit($limit)
            ->select('tags.*')
            ->get();
---
select * from `tag_variants` where `tag_variants`.`tag_id` in (10)