app/Domains/Tag/TagRepository.php

select * from `tags` where `blog_id` = 1 and `slug` = 'www.helloworld.com' limit 1
---
    public static function getTagByBlogIdAndIdentifier(int $blogId, ?int $id, ?string $slug) : ?Tag
    {
        $tag = Tag::where('blog_id', $blogId);
        if ($id) {
            $tag->where('id', $id);
        } else {
            $tag->where('slug', $slug);
        }
        return $tag->first();

select `tags`.* from `tags` inner join `tag_variants` on `tag_variants`.`tag_id` = `tags`.`id` and `tag_variants`.`language_id` = 1 where `blog_id` = 1 order by `created_at` desc limit 50 offset 0
---
    public static function getTags($blog, ?int $limit, int $offset = 0) : Collection
    {
        $limit = $limit ?? 50;
        $language = LanguageRepository::getPrimaryLanguage($blog);

        $tags = Tag::where('blog_id', '=', $blog->id)
        ->join('tags_variants', function($join) use ($language) {
            $join->on('tags_variants.tag_id', '=', 'tags.id');
            $join->where('tags_variants.language_id', '=',  $language->id);
        })
        ->select('tags.*')
        ->limit($limit)
        ->offset($offset)
        ->latest()
        ->get();

insert into `tags` (`blog_id`, `slug`, `updated_at`, `created_at`) values (1, 'thara', '2022-04-25 06:30:09', '2022-04-25 06:30:09')
select * from `languages` where `languages`.`blog_id` = 1 and `languages`.`blog_id` is not null and `is_primary` = 1 limit 1
insert into `tag_variants` (`tag_id`, `language_id`, `name`, `description`) values (31, 1, 'dd', '')
---
    public static function createTag(
        $blog,
        string $name,
        string $slug,
        ?string $description
    ) : Tag
    {
        $createTag = Tag::create([
            'blog_id' => $blog->id,
            'slug' => $slug,
        ]);

        $tagId = $createTag->id;
        $getLanguage = $blog->languages()->where('is_primary', true)->first();
        $primaryLanguage = $getLanguage->id;

        TagsVariant::create([
            'tag_id' => $tagId,
            'language_id' => $primaryLanguage,
            'name' => $name,
            'description' => $description,
        ]);

select * from `tags` where `tags`.`id` = 1 limit 1
update `tag_variants` set `name` = 'troll', `description` = '' where `tag_id` = 1 and `language_id` = 1
---
    public static function updateTag(
        int $id,
        int $languageId,
        string $slug,
        ?string $codeHead,
        ?string $codeFoot,
        ?string $name,
        ?string $description
    ): void
    {

        Tag::find($id)
        ->update([
            'slug' => $slug,
            'code_head' => $codeHead,
            'code_foot' => $codeFoot,
        ]);

        TagsVariant::where('tag_id','=',$id)
            ->where('language_id','=',$languageId)
            ->update([
                'name' => $name,
                'description' => $description,
            ]);

select `is_primary` from `languages` where `id` = '1' limit 1
delete from `tag_variants` where `tag_id` = '2' and `language_id` = '4'
delete from `tag_variants` where `tag_id` = '10' and `language_id` = '1'
select * from `tags` where `tags`.`id` = '10' limit 1
delete from `tags` where `id` = 10
---
    public static function deleteTag($tagId, $languageId) : void{

        $language = Language::where('id','=', $languageId)
        ->value('is_primary');

        if($language == 0){
            TagsVariant::where('tag_id','=',$tagId)
                ->where('language_id','=',$languageId)
                ->delete();
        }
        else{
            TagsVariant::where('tag_id','=',$tagId)
                ->where('language_id','=',$languageId)
                ->delete();

            Tag::find($tagId)
                ->delete();

select `is_primary` from `languages` where `id` = '4' limit 1
select * from `tag_variants` where `tag_id` = '4' and `language_id` = '4' limit 1
insert into `tag_variants` (`tag_id`, `language_id`) values ('4', '4')
---
    public static function createTagVariant($tagId, $languageId){

        $language = Language::where('id','=', $languageId)
        ->value('is_primary');

        if($language == 0){
            $tagVariantCheck = TagsVariant::where('tag_id','=', $tagId)
            ->where('language_id','=', $languageId)
            ->first();

            if($tagVariantCheck == null){
                TagsVariant::create([
                    'tag_id' => $tagId,
                    'language_id' => $languageId,
                ]);