app/Domains/Navigation/NavigationRepository.php

    public static function createNavigation(int $blogId, string $navigationName, string $navigationUrl, NavigationTypeEnum $type, int $sort ){
        // dd($sort);
        return Navigation::create([
            'blog_id' => $blogId,
            'name' => $navigationName,
            'url' => $navigationUrl,
            'type' => $type,
            'sort' => $sort
        ]);
---
insert into `navigations` (`blog_id`, `name`, `url`, `type`, `sort`, `updated_at`, `created_at`) values (1, 'fd', 'hello-world.com', 'footer', 7, '2022-04-25 13:36:09', '2022-04-25 13:36:09')

    public static function getFooterItemNumber(){
        return Navigation::where('type','=', 'footer')
           ->get('sort')
           ->last();
---
select `sort` from `navigations` where `type` = 'footer'

    public static function getFooterCount(){
        return Navigation::where('type','=', 'footer')
           ->count();
---
select count(*) as aggregate from `navigations` where `type` = 'header'