app/Data/Objects/ConsoleAPI/Tag/TagObject.php

    public function __construct(Tag $tag, Blog $blog)
    {
        $this->id = $tag->id;
        $this->created_at = $tag->created_at->timestamp;
        $this->updated_at = $tag->updated_at->timestamp;
        $this->slug = $tag->slug;
        $this->posts_count = $tag->posts_count;
        $this->code_head = $tag->code_head;
        $this->code_foot = $tag->code_foot;

        $this->variants = $tag->variants
            ->map(fn ($variant) => new TagVariantObject($variant, $tag, $blog))
            ->sortBy('language_id')
            ->toArray();
---
select * from `tag_variants` where `tag_variants`.`tag_id` = 31 and `tag_variants`.`tag_id` is not null