app/Domains/Route/RouteRepository.php

    public static function getRoutes(Blog $blog) : Collection {

        return Route::where('blog_id','=', $blog->id)
            ->latest()
            ->get();
---
select * from `routes` where `blog_id` = 1 order by `created_at` desc

    public static function createRoute(
        Blog $blog,
        string $name,
        string $match,
        string $template,
        string $postsFilter = null,
        string $contentType = null,
    ) : Route
    {
        return $blog->routes()->create([
            'name' => $name,
            'match' => $match,
            'template' => $template,
            'posts_filter' => $postsFilter,
            'content_type' => $contentType
        ]);
---
insert into `routes` (`name`, `match`, `template`, `posts_filter`, `content_type`, `blog_id`, `updated_at`, `created_at`) values ('About', '/test', 'test', '', '', 1, '2022-04-25 13:37:46', '2022-04-25 13:37:46')

    public static function deleteRoute(int $id) : bool {
        $data = Route::find($id);
        return $data->delete();
---
select * from `routes` where `routes`.`id` = 19 limit 1
delete from `routes` where `id` = 19