app/Domains/Blog/BlogRepository.php

select * from `blogs` where `subdomain` = 'test' and `blogs`.`deleted_at` is null limit 1
---
    public static function getBlogBySubdomain(string $subdomain): ?Blog
    {
        return Blog::where('subdomain', $subdomain)->first();

select * from `blogs` where `hosting_domain` = 'blogs.hyvor.test' and `blogs`.`deleted_at` is null limit 1
---
    public static function getBlogByCustomDomain(string $customDomain): ?Blog
    {
        return Blog::where('hosting_domain', $customDomain)->first();